[
    {
        "id": "1a2b3c4d-5678-9101-1121-314151617181",
        "title": "Tomato Cheese Omelette",
        "image": "omelette",
        "ingredients": ["Tomato", "Cheese", "Egg"],
        "instructions": "• Beat the eggs. • Chop the tomatoes. • Heat pan, add eggs, and sprinkle cheese. • Cook for 5-7 minutes.",
        "isLiked": false
    },
    {
        "id": "2b3c4d5e-6789-1011-2131-415161718192",
        "title": "Grilled Chicken Sandwich",
        "image": "chicken sandwich",
        "ingredients": ["Chicken", "Bread", "Onion"],
        "instructions": "• Grill chicken. • Toast bread. • Assemble with onions and sauce.",
        "isLiked": false
    },
    {
        "id": "4d5e6f7g-8901-1314-4151-617181920212",
        "title": "Pork & Tomato Stew",
        "image": "pork_tomato_stew.jpg",
        "ingredients": ["Pork", "Tomato", "Onion",],
        "instructions": "•Cut pork into bite-sized pieces. •Brown the pork in a pan with onions. •Add chopped tomatoes and simmer with water. •Let it cook until the pork is tender. •Serve hot with bread or rice.",
        "isLiked": false
    },
    {
            "id": "c4d8f9a2-75b1-41de-9e16-7b2f46a8b3c4",
            "title": "Cheesy Chicken Skillet",
            "image": "chicken skillet",
            "ingredients": ["Chicken", "Cheese", "Onion"],
            "instructions": "• Sauté onions in a skillet. • Add chicken and cook until golden. • Sprinkle cheese and cover until melted.",
            "isLiked": false
    },
    {
            "id": "a8b5c6d7-89e4-4c32-92ab-6b1d4e9f7a3b",
            "title": "Tomato Onion Chicken Stir-Fry",
            "image": "chicken stirfry",
            "ingredients": ["Tomato", "Onion", "Chicken"],
            "instructions": "• Heat oil in a pan. • Sauté onions until golden. • Add tomatoes and chicken, stir-fry for 10 minutes.",
            "isLiked": false
    },
    {
            "id": "e9f1b7c4-5a8d-49e2-93c4-7a6f1d2b5e9f",
            "title": "Cheese Stuffed Omelette",
            "image": "cheese omelette",
            "ingredients": ["Egg", "Cheese", "Milk"],
            "instructions": "• Beat eggs with milk. • Pour into a heated pan. • Add cheese, fold omelette, and cook for 3 minutes.",
            "isLiked": false
    },
    {
            "id": "d1a5c7b9-48e2-43f6-92d3-6b4f8e7a2c9b",
            "title": "Tomato Chicken Soup",
            "image": "tomato soup",
            "ingredients": ["Tomato", "Chicken", "Milk"],
            "instructions": "• Boil chicken until tender. • Add tomatoes and simmer for 15 minutes. • Stir in milk and serve warm.",
            "isLiked": false
    },
    {
            "id": "b4e7a9c1-3d2f-49f8-93c6-7a5b4d8e2f1c",
            "title": "Onion Cheese Scramble",
            "image": "onion_scramble",
            "ingredients": ["Onion", "Cheese", "Egg"],
            "instructions": "• Sauté onions until golden. • Add beaten eggs and stir. • Sprinkle cheese and cook until set.",
            "isLiked": false
    },
    {
            "id": "d9d7be19-6769-4c63-93b1-734a984cc02a",
            "title": "Crockpot \"Refried\" Beans",
            "image": "775585-556x370.jpg",
            "ingredients": [
                "Pepper",
                "Cumin",
                "Garlic",
                "Onion",
                "Pinto beans",
                "Up salt",
            ],
            "instructions": "Rinse the beans in a colander. Pick out any bad beans. Combine all the ingredients in the crockpot. Remove any floating beans. Cover, and cook on HIGH for 4 hours and on LOW for 2 hours. Uncover, and remove extra liquid. Leave enough liquid to reach the desired consistency when the beans are mashed. (We like our beans somewhere between the very-liquidy restaurant style beans, and the canned version of refried beans.) Mash beans with a potato masher to desired consistency. Serve warm. Store in air-tight containers in the refrigerator and use within 2 weeks, or freeze in ziplock bags for later use.",
            "isLiked": false
    },
    {
            "id": "4a42bca3-beeb-4dbd-a3f2-b865fd96d764",
            "title": "Pear and Walnut Coffee Cake",
            "image": "655406-556x370.jpg",
            "ingredients": [
                "Baking powder",
                "Baking soda",
                "Brown sugar",
                "Butter",
                "Egg",
                "Flour",
                "Allspice",
                "Cardamom",
                "Cinnamon",
                "Ginger",
                "lemon",
                "Kosher salt",
                "Lemon zest",
                "Pear",
                "Cream",
                "Butter",
                "Vanilla extract",
                "Walnut",
                "Wheat germ"
            ],
            "instructions": "Start topping by putting brown sugar, spices, flour, wheat germ, nuts and butter in a food processor. Blend down until crumbly. Cover and place in fridge to keep cold.Grease a 10 springform pan with butter, then lightly dust with flour and tap out the excess. Set aside. Toss pears with lemon juice and set aside.With an electric mixer, beat butter, sugar and lemon zest for cake batter until fluffy, approximately 3-5 minutes. Add eggs and vanilla and mix until combined.In a separate bowl, whisk together flour, baking soda, baking powder and salt. Starting with sour cream, alternately add to cake batter along with dry ingredients until just combined.Pour cake batter into the prepared pan. Top pears and sprinkle crumble topping over the fruit.Bake in a preheated oven at 350 degrees for 40-50 minutes or until a tester comes out clean. Remove from oven and cool in pan for at least 20-25 minutes before serving.",
            "isLiked": false
        },
        {
            "id": "9f517453-7a7f-42ce-bbbf-2b082eb92f8c",
            "title": "Simple Egg Salad",
            "image": "660094-556x370.jpg",
            "ingredients": [
                "Hardboiled egg",
                "Mayonnaise",
                "Dijon mustard",
                "Paprika",
                "Chive",
                "Salt",
                "pepper"
            ],
            "instructions": "Combine all ingredients in a small bowl, mixing well to combine. Serve between slices of (gluten free!) bread, as filling in a lettuce wrap, or over lettuce as a salad.",
            "isLiked": false
        },
        {
            "id": "0654c7d3-a19d-4900-b27b-9de50fd3751e",
            "title": "Classic Mint Julep",
            "image": "639618-556x370.jpg",
            "ingredients": [
                "Mint",
                "Syrup",
                "Ice",
                "Bourbon"
            ],
            "instructions": "In a tall glass, add the mint and simple syrup. With the handle of a spoon, crush and mash the leaves to extract the flavors. Fill the glass with the crushed ice and pour in the bourbon. Using a tea spoon, jiggle the contents to mix and chill. Strain into a julep cup filled with crushed ice. Garnish with fresh mint sprigs.",
            "isLiked": false
        },
        {
            "id": "4cfea604-57a2-4d81-88c3-5b7eed52b23d",
            "title": "Jumbo Blueberry Muffins",
            "image": "648647-556x370.jpg",
            "ingredients": [
                "Baking powder",
                "Blueberry",
                "Butter",
                "Buttermilk",
                "Egg",
                "Flour",
                "Sugar",
                "Lemon zest",
                "Salt",
                "Vanilla extract",
                "Vegetable oil"
            ],
            "instructions": "Preheat oven to 425 degrees f. Spray a 6-cup large-sized muffin tin lightly with cooking spray, set aside.In a small bowl combine the lemon zest and 1/3 c. sugar, using a fork, mix thoroughly.In a large bowl combine flour, baking powder and salt. In a medium bowl, combine 1 c. sugar and eggs, whisking vigorously for about 45 seconds, until the mixture is thick and homogeneous. Slowly add in melted butter and oil. Then whisk in buttermilk and vanilla. Add the liquid ingredients and the blueberries to the dry ingredients, folding until just mixed, taking care to not over mix. Scoop batter into the muffin tins and sprinkle the tops with the lemon-sugar.Bake the muffins at 425 degrees f. for 5 minutes then reduce the heat to 375 degrees f. and continue baking for about 25 minutes (rotating the pan halfway through the bake time to ensure even baking), until a toothpick inserted near the center of the muffins comes out clean with only a few crumbs attached. Let the muffins cool for about 5 minutes in the pan before removing them to a wire rack to cool.",
            "isLiked": false
        },
        {
            "id": "948c439e-e8c3-41bf-b3ba-ffb2e1004159",
            "title": "Chocolate Spelt Cake",
            "image": "639209-556x370.jpg",
            "ingredients": [
                "Spelt",
                "Butter",
                "Coffee",
                "Vanilla",
                "Baking soda",
                "Salt",
                "Brown sugar",
                "Sugar",
                "Egg",
                "Coco powder",
                "Cream",
                "Currant"
            ],
            "instructions": "Preheat Oven 350 degrees: Add tablespoon of instant coffee to the warm coffee along with the vanilla, baking soda and currants; and stir till frothy. Combine in a medium bowl the spelt, instant coco and salt. In a mix-master beat the butter, brown sugar and white sugar and mix until smooth. Add the eggs and continue to mix; slowly add the coffee mixture and continue to mix. While still mixing on low add the spelt mixture and mix. Prepare a bundt pan with butter all around and then dust all over with the instant coco. Bake 50 55 minutes or until tooth pick test comes out clean. Let the cake cool a bit before trying to remove from pan.",
            "isLiked": false
        },
        {
            "id": "d57439d7-305e-4b4c-a5e0-70b997bba107",
            "title": "Thai Green Mango Salad",
            "image": "663113-556x370.jpg",
            "ingredients": [
                "Fish sauce",
                "Thai palm sugar",
                "Lime",
                "To 3 chilli padis",
                "Garlic",
                "Shallot",
                "Shrimp",
                "Tomato",
                "Carrot",
                "Mango",
                "Long beans",
                "Roasted coarse peanuts"
            ],
            "instructions": "Pound all the ingredients in a clay mortar using a wooden pestle, then add carrot and mangoes. Serve chilled with roasted coarse peanuts.",
            "isLiked": false
        },
        {
            "id": "7f5b1b1a-7a57-45ab-982d-7a8bf1a07963",
            "title": "French Toast Croissants with Strawberries",
            "image": "643405-556x370.jpg",
            "ingredients": [
                "Butter",
                "Croissant",
                "Egg",
                "Milk",
                "Orange peel",
                "Powdered sugar",
                "Strawberry"
            ],
            "instructions": "In small mixer bowl beat together all orange butter ingredients at medium speed, scraping bowl often, until light and fluffy (1 to 2 minutes); set aside.In pie pan stir together milk, eggs and 1 teaspoon orange peel.In 10 inch skillet or griddle melt 2 tablespoons butter over medium heat.Dip 4 croissant halves into egg mixture, turning to coat both sides.Place croissant halves, cut side down, in skillet. Cook, turning once, until golden brown (3 to 4 minutes on each side). Remove to serving platter; keep warm.Repeat with remaining 2 tablespoons butter and 4 croissant halves. Dust croissant halves with powdered sugar; serve with orange butter.",
            "isLiked": false
        },
        {
            "id": "2e01c313-b6ec-496a-a242-0c481a69bf83",
            "title": "Chocolate and Szechuan Peppercorn Brownies",
            "image": "638816-556x370.jpg",
            "ingredients": [
                "Brown sugar",
                "Butter",
                "Cinnamon stick",
                "Egg",
                "Espresso",
                "Flour",
                "Granulated sugar",
                "Heavy cream",
                "Kosher salt",
                "Milk",
                "Szechuan peppercorns",
                "Semisweet chocolate chips",
                "Chocolate",
                "Cocoa powder",
                "Vanilla extract"
            ],
            "instructions": "Preheat oven to 350.Grease an 8x8 baking dish.In a large saut pan over medium heat, melt the butter and add the peppercorns and the pieces of cinnamon stick.Meanwhile, in a double boiler or microwave, melt the unsweetened chocolate and semisweet chocolate together.Stir in the espresso to the melted chocolate.Once the butter stops foaming and you can see browned bits at the bottom of the pan (about 5 minutes), take off heat and remove the peppercorns and cinnamon stick.It may be easier to strain the contents of the pan and then return just the butter to it.Stir the sugars, milk, vanilla, and salt into the butter in the pan.Then stir in the cocoa powder and chocolate and espresso mixture.Beat in the eggs, and then lastly, stir in the flour.Bake in greased pan for about 25-30 minutes, until a tester comes out clean. Feel free to underbake them a bit.Once brownies are cooled, spread ganache.I like to put them in the refrigerator to firm up the ganache.To make the ganache, bring the heavy cream and peppercorns to a simmer in a small pot.Strain the peppercorns and stir in semisweet chocolate chips.",
            "isLiked": false
        },
        {
            "id": "2f2b7b9f-fdc1-44d8-a044-e32ffefb2662",
            "title": "Blueberry, Chocolate & Cocao Superfood Pancakes - Gluten-Free/Paleo/Vegan",
            "image": "1100990-556x370.jpg",
            "ingredients": [
                "Almond flour",
                "Coconut flour",
                "Tapioca/arrowroot flour",
                "Nut/hemp/coconut milk",
                "Baking powder",
                "Vanilla bean paste/extract",
                "Himalayan sea salt",
                "Blueberry",
                "Cacao nibs",
                "Chocolate"
            ],
            "instructions": "Combine the almond, coconut, tapioca/arrowroot flour, baking powder, sugar and salt together and mix all the ingredients well before adding the milk and paste/extract and ensuring that all of the ingredients are whisked together to form a smooth batter.Allow to sit for approximately 10-15 minutes.Heat a small amount of coconut oil into a frying pan/skillet and pour a small enough amount of the batter into the middle of the pan.Allow the batter to cook sufficiently for a few minutes (the edges should start to brown and the top of the batter should start to bubble) on one side before sprinkling on a few blueberries and flipping the pancake over to cook on the other side.Immediately sprinkle on some of the cacao nibs and dark chocolate on top and continue to cook thoroughly for a few minutes before removing the pancake and setting aside.Repeat with the remaining batter until finished.Pour over the agave, give thanks and enjoy!",
            "isLiked": false
        },
        {
                "id": "c9a53eff-cdf6-4586-82c5-92f65ee036c8",
                "title": "Baked Oatmeal with Dried Cranberries",
                "image": "633692-556x370.jpg",
                "ingredients": [
                    "Almond milk",
                    "Baking powder",
                    "Banana",
                    "Cinnamon",
                    "Cranberry",
                    "Egg",
                    "Flaxseed",
                    "Oat",
                    "Salt",
                    "Vanilla extract"
                ],
                "instructions": "1.Preheat oven to 350F2.Mix dry ingredients until well combined.3. Mix liquid ingredients separately.4.Add the liquid ingredients to the dry mix.5.Mix well.5.Spray a pan with a non-stick spray - the smaller the pan, the thicker the bars will be.6.Pour the mix into the pan.7.Bake for 45 minutes.8.Enjoy!",
                "isLiked": false
            },
            {
                "id": "dd24a86d-af31-45bc-94f3-e779e36bd348",
                "title": "Buffalo Ranch Chicken Dip",
                "image": "715432-556x370.jpg",
                "ingredients": [
                    "Chicken breasts",
                    "Cream cheese",
                    "Green onions",
                    "Louisiana hot sauce",
                    "Paul prudhommes poultry seasoning",
                    "Ranch dressing",
                    "Sharp cheddar cheese"
                ],
                "instructions": "Take your chicken breasts and give them a light coat of the Poultry Magic seasoning, and then coat them with Pam cooking spray. (The Pam keeps the chicken from drying out while cooking.) Grill your chicken breasts and then allow to cool slightly.Preheat your oven to 350 degrees. Shred your chicken and then combine in a 13 x 9 inch glass baking dish with your Louisiana Hot Sauce. Place your cream cheese and dressing into a sauce pan over medium heat until the texture is smooth. Pour this mixture over your chicken and hot sauce mixture in the dish. Top with cheddar cheese and green onions.Bake un-covered for 30 minutes until bubbly. Let stand until slightly cooled, and then serve with tortilla chips of our choice!",
                "isLiked": false
            },
            {
                "id": "ddaefcec-595f-45b9-af31-912277cefa3a",
                "title": "Roasted Sunchoke, Apple, and Onion Soup",
                "image": "658674-556x370.jpg",
                "ingredients": [
                    "Sunchoke",
                    "Onion",
                    "Apple",
                    "Vegetable stock",
                    "Olive oil",
                    "S&p"
                ],
                "instructions": "Preheat oven to 400 degrees Peel sunchokes (best you can but don't obsess) and cut into die-sized pieces Large dice onion Slice apple in half lengthwise and core Toss all three in olive oil and place on a sheet pan on the bottom rack Set timer for 20 mins and then shake pan After that, shake and check more frequently Remove apples when soft and let cool then peel Leave sunchokes and onion in until some of the onion start to char Add roasted vegetables to 4 cups liquid (stock) Heat until sunchokes are soft; they may already be from the roasting Puree in blender",
                "isLiked": false
            },
            {
                "id": "3d98c84f-8563-48bf-a300-cc0d92ad7cc7",
                "title": "Turbo Chicken",
                "image": "663971-556x370.jpg",
                "ingredients": [
                    "All purpose flour dissolve in 1 of water",
                    "Sauce of the chicken from the turbo broiler",
                    "Chicken",
                    "Gravy",
                    "Bell pepper",
                    "Salt",
                    "Soy sauce",
                    "Chicken",
                    "Calamansi",
                    "Calamansi"
                ],
                "instructions": "Give the chicken a good rubdown with it, taking care to massage it inside and out. Marinade the Chicken with Soy sauce, salt and Calamondin for 10-20 minutes each side.Place a small baking pan at the bottom of the turbo broiler, this will be used to catch the drippings (don't throw this after the chicken is cooked! You can use it to make gravy, or see the explanation below).Place the chicken in a turbo broiler with the temperature of 250 degrees for 30 minutes.Turn over the chicken and cook it for another 10 minutes.It should be nicely crisp and golden brown after 40 minutes.GravySauce from the chicken, place it in a small pan (low fire)Put the dissolve flour (using water)Stir continuously until it's mixed wellAdd salt, pepper and calamondin to taste.",
                "isLiked": false
            },
            {
                "id": "f0717e39-afc6-4380-9c8f-8fc4fae5c110",
                "title": "No-Bake Fudge Brandy Brownies",
                "image": "653192-556x370.jpg",
                "ingredients": [
                    "Brandy",
                    "Butter",
                    "Condensed milk",
                    "Oreo crumbs",
                    "Vanilla extract",
                    "Walnut"
                ],
                "instructions": "In a pan, melt chocolate morsels and butter on low heat for about a minute or until completely melted. Stir occasionally. Remove from heat.In a large bowl, mix Oreo crumbs (set aside a tablespoon or two) and walnuts. Add condensed milk, vanilla extract, and chocolate mixture. Add brandy and mix well. If you're feeling a little gutsy, add another half a tablespoon of brandy for a solid kick!Line whatever container you want to put it in with foil or grease it with butter and sugar. Press the mixture firmly onto bottom of container. Garnish with Oreo crumbs on top.Refrigerate for about two hours and enjoy!",
                "isLiked": false
            },
            {
                "id": "a7623016-4434-46c8-96cd-8b081b3f4134",
                "title": "Baked Salmon With Lime",
                "image": "633779-556x370.jpg",
                "ingredients": [
                    "Salmon cutlet",
                    "Spring onion",
                    "Ginger",
                    "Chili",
                    "Cooking wine",
                    "Rind of lime",
                    "Lime juice",
                    "Peppercorn",
                    "Butter"
                ],
                "instructions": "Clean, remove all the scales and pad dry the cutlet with paper towel and place it on baking tray or foil. Season the fish all around with cooking wine, lime rind and lime juice then top it evenly with crashed peppercorns, shredded ginger, chili, spring onion and butter cubes. You can either baked it in a pre-heated oven at 200 degree for 12 minutes or you can toast it in the oven toaster for 15 - 18 minutes depend on the thickness and how well you want it to be cooked.",
                "isLiked": false
            },
            {
                "id": "edec07b6-20dc-4dca-a043-f239cc94146f",
                "title": "Chipotle Cheese Stuffed Black Bean Burgers with Avocado Creme",
                "image": "638744-556x370.jpg",
                "ingredients": [
                    "Black beans",
                    "Onion",
                    "Mushroom",
                    "Egg",
                    "Panko bread crumbs",
                    "Cumin",
                    "Chipotle chili powder",
                    "Salt/pepper",
                    "Olive oil",
                    "Approx cream cheese spread",
                    "Hamburger buns",
                    "Cheese",
                    "Spinach and tomato",
                    "Avocado",
                    "Cream",
                    "Lime juice",
                    "Sea salt"
                ],
                "instructions": "Add a swirl of olive oil to a skillet and add diced mushrooms and onions. Saute until softened then season with salt and pepper. Add drained black beans to a medium bowl and press and mash with a fork. Mix in mushrooms and onions then add egg and bread crumbs. Finally mix in cumin and chipotle chili powder. Roll and form into burger patties (sliders or full size). Form a indent in the center of each burger Add a spoonful of cream cheese spread to the indent in the burgers and then form the burger over the cream cheese. Heat a skillet over medium heat, add a swirl of olive oil. Add 2 burgers at a time and sear on each side until cooked and browned, about 4 minutes each side. If you want to add sliced cheese on top, add now and cover skillet to steam and melt cheese. Remove to a plate, then cook remaining patties. For the avocado creme, combine all ingredients in a food processor or blender, and mix until smooth. Taste and add more sour cream or lime juice if needed. To plate, add each hot cooked burger to an open toasted bun. Top with lettuce and tomato (optional) and a hearty scoop of avocado creme and then top with bun.",
                "isLiked": false
            },
            {
                "id": "93b72731-0171-4498-a466-6f4805d1df5a",
                "title": "Pulled Pork Nachos",
                "image": "1039293-556x370.jpg",
                "ingredients": [
                    "Nacho chips",
                    "Pico de gallo",
                    "Pork rub",
                    "Pork shoulder",
                    "Cheese",
                    "Cream",
                    "Vegetable broth"
                ],
                "instructions": "InstructionsClean the pork and pat dry. Add the pork rub to the shoulder and season all over. Place the pork shoulder into the crock pot and set the temperature to low. Add in the vegetable broth and cook on low for 8-10 hours. Remove from slow cooker and shred the pork. Top the nachos with the shredded pork, pico de gallo, shredded cheese, and sour cream if desired.",
                "isLiked": false
            },
            {
                "id": "bb65bd0c-c39a-43f4-9f1a-980722e3d0af",
                "title": "Strawberry Shortcake with Homemade Donuts",
                "image": "661889-556x370.jpg",
                "ingredients": [
                    "Baking powder",
                    "Cake flour",
                    "Confectioners sugar",
                    "Egg yolks",
                    "Granulated sugar",
                    "Salt",
                    "Cream",
                    "Strawberry",
                    "Vanilla extract",
                    "Shortening/vegetable lard",
                    "Whipped cream",
                    "Milk"
                ],
                "instructions": "Mix cake flour, baking powder and salt together. I don't like nutmeg so much, but if you do add it now! Set aside.In your mixer, blend the Shortening (I used plain Crisco) and sugar together on low speed until \"sandy\".Now blend in the egg yolks on low speed about 1 minute.Alternate mixing in your dry ingredients (the flour combo) and the sour cream. Be sure to scrape down the sides every now and then too.Add the vanilla extract last and mix until incorporated.Cover the batter and let sit in the fridge for 15-20 minutes.Preheat your oven to 350. Spoon your batter into a ziplock bag to use the corner as a piping bag. It's a lot easier this way I promise! Pipe dough into a greased donut pan.Bake for 10-12 minutes.While baking, prepare the icing for the donuts. In a saucepan over low heat warm the milk and then whisk in the confectioners sugar until smooth. That's it!Dip the slightly cool donuts in the icing or spoon icing over the top, whatever works for you.Now to go completely wild, cut the donut in half (like an english muffin). Slice up some strawberries and add some whip cream.Pure bliss.These donuts are super light and airy. The strawberries and whip cream just go perfectly, it's borderline life changing.",
                "isLiked": false
            },
            {
                "id": "b696c738-7d02-4e2d-88cd-ec9bfe3d04cf",
                "title": "Bing's Banana Cake",
                "image": "634986-556x370.jpg",
                "ingredients": [
                    "Baking powder",
                    "Banana flavoured essence",
                    "Banana",
                    "Bicarbonate of soda",
                    "Egg",
                    "Flour",
                    "Sugar",
                    "Optional: walnuts"
                ],
                "instructions": "Begin by preheating oven to 160C for standard heating oven, 150C for fan-forced oven. I cant stress enough how important it is to have an efficient oven when it comes to baking. So if you intend to bake regularly, please invest in an oven thermometer so that you know the exact temperature your oven heats up to.Next, grease and line a 10 X 10 X 3 square baking pan or 11 round pan. Grease first, line with baking paper and then grease again.Add 5 large eggs to a large deep mixing bowl.Add 1 cup of sugar. Feel free to cut this amount by a tablespoon or two if your bananas are very very ripe. Ripe bananas have alot of sugar in them.Add 1 teaspoon of banana flavoured essence.Peel about 5 large bananas to get 400g of bananas. Use very ripe bananas. The stronger they smell, the better. You can cut the bananas into large pieces if they are too long for the bowl.Add the bananas to the egg and sugar mixture. Beat at low speed for one minute and then at maximum speed for 14 minutes.Let the machine whisk the mixture until it resembles whipped cream. If the mixture is still runny or wet, whisk some more. It should be white, stiff and non-dripping.While the egg and banana mixture is being whisked, prepare the dry ingredients.Sieve 2 & 1/2 cups of plain flour into a bowl. Add 1 & 1/2 teaspoon of baking powder. Add 1/2 teaspoon of bicarbonate of soda.Prepare 200g of vegetable oil about 2/3 cup and 1/4 cup.Transfer the whisked egg-banana mixture to a large bowl/pot if necessary.Add the flour mixture in 3 parts to the egg-banana mixture. Fold the flour mixture into the egg-banana mixture with your hands. Use large folding movements. Do this step in 3 parts. Dont add all the flour at one time.When the flour mixture has been folded into the egg-banana mixture, add the vegetable oil. And fold that in as well. If you have chopped walnuts, add them here too. I liked my cake with no nuts.Pour the batter into the greased and lined baking pan.Bake at a pre-heated oven of 160C for standard heating oven, 150C for fan-forced oven for 55 minutes or until the cake turns golden brown. A cake pick or satay stick should come out clean when placed into the centre of the cake. A cake pick or satay stick should come out clean when placed into the centre of the cake.Place a cake base or plate over the baking pan and invert the cake over. Peel the baking paper away from the cake.Use a cooling rack and invert the cake again. Let the cake cool on the cooling rack. If you are in a dry or cold environment, place a clean towel over the cake as it cools so that it would not dry out too quickly.Best served warm.",
                "isLiked": false
            },
            {
                    "id": "e7d4ec52-5b8b-4b2d-8c48-aab7a7ac3f80",
                    "title": "Farmer's Market Wild Mushroom Risotto",
                    "image": "642595-556x370.jpg",
                    "ingredients": [
                        "Arborio rice",
                        "Bay leaves",
                        "Butter",
                        "Parmesano-reggian cheese",
                        "Chicken broth",
                        "Crimini mushrooms",
                        "Wine",
                        "Garlic",
                        "Morel mushrooms",
                        "Olive oil",
                        "Onion",
                        "Parsley",
                        "Salt and pepper",
                        "Ts thyme",
                        "Truffle oil"
                    ],
                    "instructions": "Heat the chicken broth in a medium saucepan and keep warm over low heat.Heat 1 tablespoon of oil in a large skillet over medium heat. Add 1/2 onion and 1 clove garlic, cook, stirring, until translucent, about 5 minutes.Add the fresh mushrooms, herbs and butter. Saute for 3 to 5 minutes until lightly browned, season with salt and pepper. Season with salt and fresh cracked pepper. Saute 1 minute then remove from heat and set aside.Coat a saucepan with remaining 2 tablespoons of oil. Over medium heat, saute the remaining 1/2 onion and garlic clove. Add the rice and stir quickly until it is well-coated and opaque, 2-3 minutes.Add vegetable stock and cook for 20 minutes without the lid on.Stir in wine and cook until it is nearly all evaporated.With a ladle, add 1 cup of the warm broth and cook, stirring, until the rice has absorbed the liquid. Add the remaining broth, 1 cup at a time, cooking and stirring, allowing the rice to absorb each addition of broth before adding more. The risotto should be slightly firm and creamy, not mushy.Transfer the mushrooms to the rice mixture.Stir in Parmesan cheese, cook briefly until melted. Top with a drizzle of truffle oil and chopped parsley before serving.",
                    "isLiked": false
                },
                {
                    "id": "84515c5c-0f16-44c3-94de-3acf1cb0527d",
                    "title": "Apple Roasted Pork Loin",
                    "image": "632590-556x370.jpg",
                    "ingredients": [
                        "Pork loin",
                        "Granny smith apples",
                        "Olive oil",
                        "Garlic",
                        "Honey",
                        "Apple cider vinegar",
                        "Pepper",
                        "Sea salt",
                        "Five spice powder",
                        "Nutmeg"
                    ],
                    "instructions": "Apple Roasted Pork Loin Apples and pork is a pretty traditional combination and I couldn't count the number of ways I've put the two together in the past but this one is a little different. The Granny Smith apples are diced quite small and then cooked in a reduction of honey, apple cider vinegar and spices. Granny Smiths are good to use because they won't break down into apple sauce during the cooking. The cooked apples are then used as a top crust and glaze for the roast pork. Some garlic roast potatoes and steamed veggies completed a wonderful family meal. Here's your Sunday supper! Lb pork loin or rib roast Season the pork with salt and pepper and open roast on a rack in a roasting pan at 375 degrees F for about a half hour. Meanwhile dice very small, (about a 1/4 inch dice) Large Granny Smith apples, peeled and cored In a large saute pan over medium heat add: Tbsp olive oil Cloves minced garlic Cook for a minute or two to soften but not brown the garlic. Add: Cup honey Cup apple cider vinegar Tsp pepper Tsp sea salt Teaspoon Chinese five spice powder Tsp freshly grated nutmeg Bring the mixture to a boil and simmer until the volume is reduced by about half. Increase the heat to mediun-high. Add the diced apple and cook, stirring occasionally until most of the liquid has reduced off. After half an hour in the oven, take the roast out and spoon the apples all over the top. Return the roast to the oven, reduce the heat to 350 degrees F and cook uncovered until the internal temperature reaches 170 degrees F on a meat thermomether inserted into the center of the roast. Allow the pork to rest for about 15 minutes before carving and serving.",
                    "isLiked": false
                },
                {
                    "id": "f83f73aa-0d67-4aad-b9e3-008af77fbcb7",
                    "title": "Lentil Salad With Vegetables",
                    "image": "649931-556x370.jpg",
                    "ingredients": [
                        "Balsamic vinegar",
                        "Extra virgin olive oil",
                        "Green onions",
                        "Lentil",
                        "Bell pepper",
                        "Bell pepper",
                        "Red wine vinegar",
                        "Rosemary",
                        "Salt",
                        "Tomato",
                        "Onion"
                    ],
                    "instructions": "Heat olive oil in a saucepan over medium high heat and add onion. Cook until just translucent and then add lentils. Add water and cook according to package directions. Drain and cool.Combine lentils with tomatoes, pepper, onions, rosemary, olive oil, and vinegars. Season with salt and pepper to taste and adjust oil or vinegar as desired.Serve cold or at room temperature.",
                    "isLiked": false
                },
                {
                    "id": "90461a01-b50e-4e75-8764-81cccabe5efc",
                    "title": "Naturally Sweet Apple Turnovers",
                    "image": "652976-556x370.jpg",
                    "ingredients": [
                        "Apple",
                        "Brown sugar",
                        "Cream cheese",
                        "Egg yolk",
                        "Dough",
                        "Flour",
                        "Ground allspice",
                        "Ground cardamom",
                        "Ground cinnamon",
                        "Ground ginger",
                        "Juice of lemon",
                        "Kosher salt",
                        "Maple syrup",
                        "Milk",
                        "Powdered sugar",
                        "Sugar",
                        "Butter",
                        "Frangelico",
                        "Frangelico"
                    ],
                    "instructions": "Start dough by whisking dry ingredients in a medium sized bowl. Add butter and incorporate with a pastry blender until coarse crumbs develop. Add cream cheese and incorporate well.Plop in egg yolk and stir with a fork until dough comes together into a ball.Turn dough out onto a floured surface and roll into a uniform ball. Slightly press flat with the palm of your hand and wrap in plastic wrap. Chill at least one hour.Once dough has chilled, set it on a floured surface and roll it out to about 10 x 12. Cut into sixten even squares. Lay the dough squares on a parchment paper covered baking sheet and set in the freezer to chill.In a separate bowl, toss the apples with the lemon juice, maple syrup, spices and brown sugar. Make sure to cover all of the apple pieces.Take dough out of freezer. Drop about 1 tablespoon of filling into the center of each piece of dough. Fold one pointed edge towards its opposite corner to form a triangle. Crimp edges with a fork along the seams. Repeat with all of the dough.Brush a little milk over the top of each turnover and sprinkle with extra sugar if desired. (Pop back into the freezer for a quick chill if the dough is soft.). Bake in a preheated oven at 400 degrees for 20 minutes or until browned.",
                    "isLiked": false
                },
                {
                    "id": "1ea8968b-6a80-4a4e-a005-f8f47c6c737a",
                    "title": "Asparagus With Black Pepper-Pecorino Zabaglione",
                    "image": "632957-556x370.jpg",
                    "ingredients": [
                        "Asparagus spears",
                        "Egg yolks",
                        "Flat-leaf parsley leaves",
                        "Heavy cream",
                        "Marsala",
                        "Mustard",
                        "Olive oil",
                        "Pecorino romano cheese",
                        "Pepper",
                        "Shallot",
                        "Sherry vinegar"
                    ],
                    "instructions": "Bring 6 quarts of water to a boil and add 2 tablespoons of salt.Set up an ice bath nearby.Blanch the asparagus in the boiling water for 90 seconds. Using tongs, transfer the asparagus to the ice bath. Let cool, then transfer the asparagus to a plate lined with paper towels. Reserve the ice bath.In a small bowl, combine the shallots, sherry vinegar, mustard, and salt and pepper to taste.Gently whisk in the olive oil until the mixture is emulsified. Set aside.To prepare the zabaglione, in a stainless-steel bowl, whisk the egg yolks, 2/3 tablespoon of the pepper, and the Marsala until foamy.Place the bowl over simmering water and continue whisking until the mixture is thick, about 10 minutes.Set the bowl over the ice bath and whisk until chilled, 4 to 5 minutes.Whip the cream until stiff peaks form. Carefully fold the whipped cream, 4 tablespoons of the Pecorino Romano, and 1 tablespoon of the pepper into the chilled zabaglione.Refrigerate until ready to serve.To assemble the dish, place 6 spears of asparagus on each of 4 chilled dinner plates. Stir the parsley into the vinaigrette and drizzle it around and across the asparagus.Spoon a dollop of the zabaglione onto each plate and sprinkle with the remaining tablespoon of cheese and parsley. Serve immediately.",
                    "isLiked": false
                },
                {
                    "id": "959a730a-34aa-4bd4-b2ce-aaa783925ddc",
                    "title": "Tex-Mex Polenta Rounds with Chunky Guacamole",
                    "image": "663054-556x370.jpg",
                    "ingredients": [
                        "Avocado",
                        "Chili powder",
                        "Co y jack cheese",
                        "Bell pepper",
                        "Polenta",
                        "Salsa",
                        "Salt",
                        "Onion"
                    ],
                    "instructions": "Cut Polenta into 12-24 half inch medallions, depending on size of tubesprinkle with chili powderin a frying pan, heat olive oil and add roundscook rounds for about 5 minutes on each side, or until golden brownMeanwhile, cut up Avocado, Onion and PepperMix with seasoningsOnce medallions are cooked, add toppings as desired and enjoy!",
                    "isLiked": false
                },
                {
                    "id": "fd5dba82-1fef-41d3-bf17-061f19db7139",
                    "title": "Apple Cheddar Turkey Burgers With Chipotle Yogurt Sauce",
                    "image": "632502-556x370.jpg",
                    "ingredients": [
                        "Apple",
                        "Bread crumbs",
                        "Ground turkey",
                        "Chipotle hot sauce",
                        "Onion",
                        "Yogurt",
                        "Salt and pepper",
                        "Sharp cheddar cheese",
                        "Garnish"
                    ],
                    "instructions": "Mix burger ingredients in a bowl and shape into 4-6 patties. Grill (or pan fry) for 2 minutes each side or until juices run clear. Serve with a dollop of chipotle yogurt sauce.",
                    "isLiked": false
                },
                {
                    "id": "a5b50096-b35e-4b7d-9677-cd1f866ad40f",
                    "title": "Hard-Boiled Egg Gratin In A Bechamel Sauce",
                    "image": "646302-556x370.jpg",
                    "ingredients": [
                        "Butter",
                        "Egg",
                        "Flour",
                        "Gruyère cheese",
                        "Milk",
                        "Nutmeg",
                        "Onion",
                        "Salt and pepper"
                    ],
                    "instructions": "Hard-boil the eggs: bring a saucepan of salted water to the boil. Add the eggs, reduce the heat and simmer for 10 minutes. Put the eggs into cold water until just cool enough to handle and then shell. (A trick for shelling hard-boiled eggs is to roll them with the palm of your hand on a hard surface to break up the shell and then peel them under a slow stream of running water.) Reserve the eggs in a bowl of warm water.Melt the butter in a saucepan or small frying pan over low heat. Add the onion and cook, stirring frequently, until tender but not coloured.Prepare the bchamel sauce: melt the butter in a medium heavy-bottomed saucepan over low heat. Add the flour and whisk for about 2 minutes; do not allow it to colour. Whisk in the milk and bring to the boil, whisking constantly to avoid lumps. Season with the nutmeg and salt and pepper to taste. Reduce the heat and simmer for 10 minutes, whisking constantly and scraping the bottom and sides of the pan to prevent the sauce from sticking. Stir in the cooked onions and cook for 5 minutes.Heat the grill. Slice the eggs 1 cm (0.4 inch) thick. Spread a thin layer of the bchamel sauce over the bottom of the gratin dish. Layer the egg slices over the bchamel sauce and coat with the remaining sauce. Sprinkle with grated cheese, then grill, turning the dish if necessary to colour evenly, until the top is golden brown. Serve immediately.",
                    "isLiked": false
                },
                {
                    "id": "ac899b9e-d874-4536-b32e-3322380625c3",
                    "title": "Chocolatey Overnight Oats with Strawberries",
                    "image": "639303-556x370.jpg",
                    "ingredients": [
                        "Agave nectar",
                        "Almond milk",
                        "Chia seeds",
                        "Cocoa powder",
                        "Non-fat greek yogurt",
                        "Oatmeal",
                        "Strawberry"
                    ],
                    "instructions": "Mix all the ingredients, except for the strawberries.Place a bit of the oatmeal batter into a jar or other airtight container. Add slices of strawberries on top. Add another layer of oatmeal batter and strawberries. Top with the remaining oatmeal batter.Put it in the refrigerator overnight.Enjoy!",
                    "isLiked": false
                },
                {
                    "id": "6f264717-0750-4339-9622-f96af0a661d7",
                    "title": "Cajun Shrimp Chowder",
                    "image": "636742-556x370.jpg",
                    "ingredients": [
                        "Asparagus spears",
                        "Bacon",
                        "Seafood broth",
                        "Cajun spice",
                        "Corn",
                        "Garlic",
                        "Heavy cream",
                        "Lemon pepper",
                        "Old bay seasoning",
                        "Onion",
                        "Salt and pepper",
                        "Shrimp",
                        "Tomato"
                    ],
                    "instructions": "Grab up your frying pan and cook up the three strips of bacon. When they're cooked up, pull them out, chop them up, and drain the bacon fat, reserving about a tablespoon. Turn your heat up to medium and add in your asparagus, onion, and garlic. Cook it up for 2 to 3 minutes.Add in the corn and tomatoes.Mix it together, give it a minute or two to warm up and then add in the broth, the chopped bacon and your spices; the old bay, cajun, lemon pepper, and salt and pepper to taste.Let the whole kit and kaboodle heat up for a good five minutes and then add in your cream.And last but most definitely not least, grab up your shrimp and pop them into the pan.Give the whole pan a swirl or two and allow the soup a couple minutes to heat back up.Serve with green onions sprinkled over the top.",
                    "isLiked": false
                },
                {
                        "id": "a6cc7ffc-ae85-4b14-b0a2-25a6ad731279",
                        "title": "Not Momofuku Ginger Scallion Noodles",
                        "image": "653304-556x370.jpg",
                        "ingredients": [
                            "Fish sauce",
                            "Garlic",
                            "Ginger",
                            "Grapeseed oil",
                            "Of green onions",
                            "Honey",
                            "Himalayan salt",
                            "Chile pepper",
                            "Rice wine vinegar",
                            "Sesame seed oil",
                            "Shallot",
                            "Soba noodles",
                            "Wheat free tamari sauce"
                        ],
                        "instructions": "Heat up the grapeseed oil in a saucepan over high heat until the oil is shimmery and hot, but not smoking.Add the green onions, ginger, garlic and shallots at once, but be careful, the oil will bubble and splatter. The onions will sizzle and wilt almost immediately and turn a bright green.Take the pan off the heat and stir the sauce with a wooden spoon. Add the fish sauce, sesame seed oil, rice wine vinegar, soy sauce, honey, crushed red chile pepper and salt to taste.Let sit for 15 minutes, then toss with your favorite noodles. I used fresh Chinese egg noodles.",
                        "isLiked": false
                    },
                    {
                        "id": "83df7cc9-8dcf-46c3-aeac-6f6ae9f0d511",
                        "title": "Lemon Drop Jello Shots",
                        "image": "649625-556x370.jpg",
                        "ingredients": [
                            "Lemon",
                            "Lemon jello",
                            "Sugar",
                            "Water",
                            "Lemon juice",
                            "Lemon vodka"
                        ],
                        "instructions": "Empty out the citrus to create a vessel. Juice the citrus first as it makes it easier for pulp removal. Reserve juice. Hallow out the citrus by turning them inside out and take out the pith and membrane. Make jello according to recipe above. Place citrus cups into muffin pan holes. Pour in jello. Chill overnight - Use a sharp, straight edge knife to cut into wedges",
                        "isLiked": false
                    },
                    {
                        "id": "3b6f202d-11ea-48cf-b928-34699fcf8925",
                        "title": "How Sweet It Is Sweet Potato Lasagne",
                        "image": "647563-556x370.jpg",
                        "ingredients": [
                            "Baby portabella mushrooms",
                            "Curry powder",
                            "Basil leaves",
                            "Eggplant",
                            "Spinach",
                            "Heavy cream",
                            "Montery jack & cheddar cheese mix",
                            "Jalapeno",
                            "Marinara sauce",
                            "Salt & pepper",
                            "Sweet potatoes",
                            "Vegetable cooking oil"
                        ],
                        "instructions": "Slice the Sweet Potato into 1/4 inch thick slices. Boil until semi-cooked (about 10 min). Rub the slices with a dry curry powder & olive oil (1cup) mixture. Set aside and let marinate for at least 10 min.Slice Eggplants into 1/4 inch thick slices and rub all over with an olive oil (1 cup)/dried basil/salt & pepper mix. Set aside and let marinate for at least 15 min.Pour canola or vegetable cooking oil into a pan. Saute spinach and mushrooms for about 3-5 min, add in jalapenos and salt & pepper to taste.Turn the heat down and add in some heavy cream and about 1/2 of the mexican cheeses until mixture is creamy, but not watery.Start layering the lasagne in this order: Sweet Potatoes, Spinach/Mushroom Mix, Eggplants, Marinara Sauce, Sweet Potatoes, Spinach/Mushrom Mix, Eggplants, Then finally sprinkle the remaining Monterey Jack/Cheddar Cheese Blend on top.Bake at 350-375 for about 35-45 min, depending on how your oven works. You'll know it's ready when you can pass through a fork easily through all the layers.Devour with Passion",
                        "isLiked": false
                    },
                    {
                        "id": "3d4e8403-ccac-4a58-ad7d-278f93a5cd6e",
                        "title": "Vanilla and Lime Flan By Esperanza Platas Alvarez (Planet Food Mexico)",
                        "image": "664284-556x370.jpg",
                        "ingredients": [
                            "Condensed milk",
                            "Egg",
                            "Lime",
                            "Sugar",
                            "Vanilla pod",
                            "Water",
                            "Milk"
                        ],
                        "instructions": "Preheat the oven to 360 degrees Fahrenheit.To make the caramel, heat together the water and sugar gently over a medium flame for about 10 minutes, ensuring the mixture does not burn.Meanwhile, pour the condensed milk and whole milk into a pan. Add the zest of the limes. Slice the vanilla pod in half and carefully scrape out the vanilla seeds and add these to your milk mixture.Simmer the milk slowly for fifteen minutes to let the flavours infuse.Once the caramel is ready, pour into a cake pan and swirl it around to evenly coat the bottom of the pan. Set aside.In a bowl, crack the eggs and beat together. Slowly pour a little of the warm milk , vanilla and lime mixture into the eggs. This will temper the eggs and prevent them from scrambling from the heat. Once the temperature of the eggs has been raised by the warm milk, pour in the rest of the milk. Pour all of the mixture into the cake pan over the caramel.Cook the cake pan in a water bath by placing the pan inside a larger pan which is filled half way with water. Place in the oven and cook for 45 minutes to an hour.Once ready, allow to cool and place inside a fridge overnight. The flan is then ready to be flipped over gently and served.",
                        "isLiked": false
                    },
                    {
                        "id": "a35674b4-9827-4fbb-9fa4-1d468960486d",
                        "title": "Barbecued Baby Back Pork Ribs and Bush's Grillin' Beans",
                        "image": "634295-556x370.jpg",
                        "ingredients": [
                            "Baby back pork ribs",
                            "Peppercorn",
                            "Brown sugar",
                            "Cider vinegar",
                            "Coriander",
                            "Garlic",
                            "Green onions",
                            "Ketchup",
                            "Molasses",
                            "Orange zest",
                            "Soy sauce"
                        ],
                        "instructions": "Before Cooking:A. Before marinating the ribs, remove the white membrane on the underside of the ribs. Start the removal with a sharp knife then use a paper towel to grab it and simply pull it off.B. Mix all the marinade ingredients and pour over ribs in a flat casserole dish. If you have any extra marinade, don't pour it on and save it for after the ribs are cooked.C. Marinate the ribs for at least 1 hour; but preferably for several hours before cooking.Cooking:1. Spray the BBQ grill rack with oil so the ribs wont stick. Place ribs on the grill, bone side down over low to medium heat; about 300*F.2. Cook for about 20 minutes; and when the ribs start getting burnt on the underside, place them on aluminum foil so they cook but dont burn. Cook for another 20 minutes or so until done. A cut next to a bone will show no red.3. Cut into individual ribs and serve hot with grillin' beans or whatever you choose. Then enjoy the wonderful flavor.",
                        "isLiked": false
                    },
                    {
                        "id": "14bf09a4-1d32-4334-a26f-518ef5c84635",
                        "title": "Spinach Coriander Chive Bread",
                        "image": "661292-556x370.jpg",
                        "ingredients": [
                            "All purpose flour",
                            "Flour",
                            "Milk",
                            "Sunflower oil",
                            "Yeast",
                            "Sugar",
                            "Salt",
                            "Chive",
                            "Coriander leaves",
                            "Spinach",
                            "Milk to brush the bread",
                            "Seeds to sprinkle on the bread"
                        ],
                        "instructions": "Preheat the oven to 200 degree C and grease a baking tray. Place the milk, sugar and yeast in a bowl. Mix well and leave in a warm place until frothy, about 10 - 15 minutes Sift the flours, chives, coriander leaves, spinach and salt into a bowl. Rub in the oil until the mixture resembles fine breadcrumbs. Add the yeast mixture to the flour and mix to form a soft but manageable dough( add 1 tbsp of flour at a time, if the dough is too sticky, but avoid adding too much of flour). Place the dough in an oiled bowl, cover with cling film and leave to rise in a warm place until double in size (about an hr). Turn out onto a floured surface, knead again lightly and shape the dough into a loaf. Allow the loaves to rest on a greased baking tray, covered loosely with a plastic wrap and leave to rise in a warm place until it doubles in size. Remove the plastic wrap. Brush the top of the loaves with some milk and sprinkle the seeds. Bake in the preheated oven for 15-20 minutes. Allow to cool on a wire rack completely.",
                        "isLiked": false
                    },
                    {
                        "id": "e25d07d0-2a8b-4d77-aba5-43c4a387f95b",
                        "title": "Brown Rice Vegetable Pulao",
                        "image": "636295-556x370.jpg",
                        "ingredients": [
                            "Brown basmati rice",
                            "Carrot",
                            "Celery stalks",
                            "Chilly",
                            "Lentil",
                            "Onion",
                            "Orange juice",
                            "Salt and pepper",
                            "Spring onion including the part",
                            "Vegetable oil",
                            "Vegetable stock",
                            "Almond",
                            "To garnish"
                        ],
                        "instructions": "Heat 2 tbsp of oil in a frying pan over medium heat. Add the chopped onion and saute well till softened.Add the celery, carrot, chilli, spring onions and almonds. Stir-fry for 2 minutes or until the vegetables are done. Transfer to a bowl and set aside.Add the remaining oil to the pan. Stir in the rice and lentils. Cook over medium heat, stirring for 2 minutes.Reduce the heat and stir in the veg stock and orange juice. Season with salt and pepper.Mix the already cooked vegetables to the pan. Toss with the rice for a few minutes until heated through.Transfer to a warmed dish, garnish with leaves and serve.",
                        "isLiked": false
                    },
                    {
                        "id": "e1095021-b530-4933-b796-11ccee190d84",
                        "title": "Apple Cheddar Turkey Burgers With Chipotle Yogurt Sauce",
                        "image": "632502-556x370.jpg",
                        "ingredients": [
                            "Apple",
                            "Bread crumbs",
                            "Ground turkey",
                            "Chipotle hot sauce",
                            "Onion",
                            "Yogurt",
                            "Salt and pepper",
                            "Sharp cheddar cheese",
                            "Garnish"
                        ],
                        "instructions": "Mix burger ingredients in a bowl and shape into 4-6 patties. Grill (or pan fry) for 2 minutes each side or until juices run clear. Serve with a dollop of chipotle yogurt sauce.",
                        "isLiked": false
                    },
                    {
                        "id": "5a7356bc-658a-4119-9186-1b4626f18d50",
                        "title": "Seafood Gumbo",
                        "image": "659638-556x370.",
                        "ingredients": [
                            "Bay leaves",
                            "Celery",
                            "Rice",
                            "Filé powder",
                            "Fish stock",
                            "Flour",
                            "Garlic",
                            "Bell peppers",
                            "Lump crab meat",
                            "Oil",
                            "Okra",
                            "Onion",
                            "Dozens oysters",
                            "Salt and pepper",
                            "Creole seasoning blend",
                            "Shrimp",
                            "Thyme leaves",
                            "Tomato"
                        ],
                        "instructions": "Heat oil in a large heavy stockpot over medium-high heat.Add the flour and stir constantly until a light brown roux is formed.Add the onions, bell pepper, celery and garlic. Saut until the onions become translucent and the vegetables are tender.Add the tomatoes and tomato pure and cook over medium heat for 10 minutes.Add the Creole seasoning, thyme, bay leaves and about 1/2 teaspoon each of salt and pepper, and continue to cook another 10 minutes.Add the okra, and cook for another 10 minutes, then add the stock. Bring to a boil, then reduce heat to simmer and cook another 30 minutes.Reduce heat to low.About 10 minutes prior to serving, add the shrimp, oysters and oyster liquor. Just prior to serving, add the crab meat (the crab meat does not need to be cooked, just stir until it is heated through.Taste and correct seasonings if necessary.Remove from heat and sprinkle the fil powder on the surface of the gumbo; cover and let stand for 15 minutes. Uncover and stir to mix.Serve hot with French bread and cold beverages.",
                        "isLiked": false
                    },
                    {
                        "id": "0993fa90-dd48-47c1-b4bd-55c0ae0d4515",
                        "title": "Farfalle With Broccoli, Carrots and Tomatoes",
                        "image": "642582-556x370.jpg",
                        "ingredients": [
                            "Farfalle pasta",
                            "Peanut oil",
                            "Carrot",
                            "Broccoli heads",
                            "Scallion",
                            "Garlic cloves",
                            "Parmigiano-reggiano",
                            "Grape tomatoes"
                        ],
                        "instructions": "Bring a large pot of water to boil Cook pasta about one or two minutes less than recommended on package directions. Clean and slice the carrots into thin rounds Cut the broccoli into small florets Roughly dice the stalks Thinly slice the green onions Heat the peanut oil in a skillet over medium-high heat Add minced garlic and saute for about 30 seconds Add broccoli and carrots, and cook 3-5 minutes until the vegetables are softened but are still crisp Add the scallions and cook for another 30 seconds Season well with salt and remove from heat. Mix the vegetables and the pasta, let cool T Then add tomatoes and cheese (note: if cooking ahead of time, wait to add the tomatoes and cheese until about an hour before serving).",
                        "isLiked": false
                    },
                    {
                        "id": "e0a833cd-36ea-4892-91e3-8ecca6f9abb6",
                        "title": "Instant Pot Chili Mac",
                        "image": "1165787-556x370.jpg",
                        "ingredients": [
                            "Olive oil",
                            "Ground beef",
                            "Onion",
                            "Bell pepper",
                            "Cayenne pepper",
                            "Garlic powder",
                            "Cumin",
                            "Chili powder",
                            "Pepper",
                            "Pepper",
                            "Oregano",
                            "Chicken broth",
                            "Tomato",
                            "Kidney beans",
                            "Monterrey jack cheese",
                            "Elbow macaroni"
                        ],
                        "instructions": "Instructions Turn on the pressure cooker and place on sauté mode. Once heated, add the olive oil, onion, and bell pepper. Sauté for 3 minutes. Add in the ground beef and continue to stir until the beef is thoroughly cooked. Add in the seasonings. Stir. Add crushed tomatoes and kidney beans and mix well. Pour in chicken broth and macaroni noodles. Stir the mixture until well combined. Hit the cancel button on the Instant Pot. Securely place the lid on the pressure cooker and lock the lid in place. Set the vent to seal and start the manual cook time for 4 minutes. Once the cooking time is finished, carefully place the valve to vent and allow the pressure pin to drop before unlocking the lid to the Instant Pot. Remove the lid and stir the chili mac recipe well. Mix in the cheese. Add your favorite toppings and serve.",
                        "isLiked": false
                    },
                    {
                        "id": "dd52ae7f-c275-4478-9686-d051fd61545e",
                        "title": "Easy Turtle Pumpkin Pie",
                        "image": "642133-556x370.jpg",
                        "ingredients": [
                            "Chocolate sandwich cookies",
                            "Butter",
                            "Heavy whipping cream",
                            "Sugar",
                            "Caramel sauce",
                            "Pecan",
                            "Vanilla pudding",
                            "Milk",
                            "Pumpkin puree",
                            "Cinnamon"
                        ],
                        "instructions": "Preheat oven to 350F. In a large mixing bowl or the bowl of a stand mixer, combine cream and sugar. Beat until stiff peaks form and set aside. To make the crust, place cookies and butter in a food processor, pulse until finely ground. Press into a 9-inch pie plate and bake at 350F for 10 minutes. Set aside to cool. Combine pudding mix, pumpkin, milk and cinnamon in large bowl until well combined. Fold in half of the whipped cream and pour into your prepared crust. Top pie with the remaining whipped cream, drizzle with caramel sauce and sprinkle the pecans on top. Refrigerate for at least 1 hour (or overnight) before serving. * You can also try make this in a springform pan, but I would recommend popping the cake in the freezer before unmolding/serving -- just be sure not to let it warm up too much or it might start to collapse!",
                        "isLiked": false
                    },
                    {
                        "id": "1c4d93b8-111b-49e9-ae97-39dd7e56446a",
                        "title": "Mexi-Chicken Roll Ups",
                        "image": "651546-556x370.jpg",
                        "ingredients": [
                            "Cream cheese",
                            "Salsa verde",
                            "Bunch cilantro",
                            "Cumin",
                            "Garlic powder",
                            "Chicken breasts",
                            "Spinach",
                            "Pepper jack cheese",
                            "Tortilla chips"
                        ],
                        "instructions": "Flatten out the chicken breasts to about 1/4\" thickness. Blend together the cream cheese, salsa, cilantro, cumin and garlic powder to form a sauce. Spread spoonful of sauce across each breast. Top with spinach leaves and then cheese. Roll closed and cover in crushed tortilla chips. Bake at 350 covered for 30 to 35 minutes or until chicken is cooked through.",
                        "isLiked": false
                    },
                    {
                        "id": "0404e8d8-38a0-491d-9646-c854e1a1b6c6",
                        "title": "Bing's Banana Cake",
                        "image": "634986-556x370.jpg",
                        "ingredients": [
                            "Baking powder",
                            "Banana flavoured essence",
                            "Banana",
                            "Bicarbonate of soda",
                            "Egg",
                            "Flour",
                            "Sugar",
                            "Optional: walnuts"
                        ],
                        "instructions": "Begin by preheating oven to 160C for standard heating oven, 150C for fan-forced oven. I cant stress enough how important it is to have an efficient oven when it comes to baking. So if you intend to bake regularly, please invest in an oven thermometer so that you know the exact temperature your oven heats up to.Next, grease and line a 10 X 10 X 3 square baking pan or 11 round pan. Grease first, line with baking paper and then grease again.Add 5 large eggs to a large deep mixing bowl.Add 1 cup of sugar. Feel free to cut this amount by a tablespoon or two if your bananas are very very ripe. Ripe bananas have alot of sugar in them.Add 1 teaspoon of banana flavoured essence.Peel about 5 large bananas to get 400g of bananas. Use very ripe bananas. The stronger they smell, the better. You can cut the bananas into large pieces if they are too long for the bowl.Add the bananas to the egg and sugar mixture. Beat at low speed for one minute and then at maximum speed for 14 minutes.Let the machine whisk the mixture until it resembles whipped cream. If the mixture is still runny or wet, whisk some more. It should be white, stiff and non-dripping.While the egg and banana mixture is being whisked, prepare the dry ingredients.Sieve 2 & 1/2 cups of plain flour into a bowl. Add 1 & 1/2 teaspoon of baking powder. Add 1/2 teaspoon of bicarbonate of soda.Prepare 200g of vegetable oil about 2/3 cup and 1/4 cup.Transfer the whisked egg-banana mixture to a large bowl/pot if necessary.Add the flour mixture in 3 parts to the egg-banana mixture. Fold the flour mixture into the egg-banana mixture with your hands. Use large folding movements. Do this step in 3 parts. Dont add all the flour at one time.When the flour mixture has been folded into the egg-banana mixture, add the vegetable oil. And fold that in as well. If you have chopped walnuts, add them here too. I liked my cake with no nuts.Pour the batter into the greased and lined baking pan.Bake at a pre-heated oven of 160C for standard heating oven, 150C for fan-forced oven for 55 minutes or until the cake turns golden brown. A cake pick or satay stick should come out clean when placed into the centre of the cake. A cake pick or satay stick should come out clean when placed into the centre of the cake.Place a cake base or plate over the baking pan and invert the cake over. Peel the baking paper away from the cake.Use a cooling rack and invert the cake again. Let the cake cool on the cooling rack. If you are in a dry or cold environment, place a clean towel over the cake as it cools so that it would not dry out too quickly.Best served warm.",
                        "isLiked": false
                    },
                    {
                        "id": "da282a9c-71c3-4e86-8d1e-7c797f3d1bf2",
                        "title": "Apple Persimmon Sauce",
                        "image": "632574-556x370.jpg",
                        "ingredients": [
                            "Persimmon",
                            "Apple",
                            "Ground cinnamon",
                            "Nutmeg",
                            "Water",
                            "Brown sugar",
                            "Lemon juice"
                        ],
                        "instructions": "Combine all ingredients in a medium pot and bring to a boil. Cover and reduce heat to medium low. Simmer for 25-30 minutes. Mash apple sauce with a potato masher until its your desired consistency. Store in an airtight container in the fridge for up to two weeks. Can also be frozen and stored for up to a year.",
                        "isLiked": false
                    },
                    {
                        "id": "e35cb387-6c2b-4f99-ace4-8aaac115d60b",
                        "title": "Crab and Shrimp Burgers With Garlic Grits Fries",
                        "image": "640266-556x370.jpg",
                        "ingredients": [
                            "Shrimp",
                            "Crab meat",
                            "Juice of lemon",
                            "Tabasco sauce",
                            "Dijon mustard",
                            "Mayonnaise",
                            "Jalapeno",
                            "Onion",
                            "Parsley",
                            "Pepper",
                            "Kosher salt",
                            "Panko crumbs",
                            "Egg",
                            "Bread crumbs",
                            "Seafood seasoning",
                            "Butter",
                            "Grit",
                            "Water",
                            "Milk",
                            "Kosher salt",
                            "Mozzarella cheese",
                            "Garlic"
                        ],
                        "instructions": "Burgers: In a large bowl, carefully mix all of the ingredients except the breadcrumbs, seafood seasoning and butter. Form into 8 patties and set on a baking sheet. Chill for an hour. Once chilled, cover all sides of the patties with bread crumbs and lay on a separate baking sheet. Bake in an oven preheated to 375 degrees for 15-20 minutes, flipping once. If desired, top with a bit of butter and set the burgers onto a vegetable grill basket. Heat for 1-2 minutes on a preheated grill just for flavor and a little color. Serve on warm buns. Fries: Cook the grits according to the package directions. Stir in the cheese and salt just before removing from heat. Carefully pour the hot grits into a large, shallow plastic container. Allow the grits to cool down to room temperature. Cover, then chill overnight. When ready, overturn the grits onto a large cutting board and cut into 1/2 wide pieces. Lay them on a parchment paper covered baking sheet and bake in a preheated oven at 425 degrees for 30-40 minutes or until browned. Flip them once to brown all sides.",
                        "isLiked": false
                    },
                    {
                        "id": "f1b74ca8-75e1-4645-9f9f-c34c445314a6",
                        "title": "Simple Squash Salad",
                        "image": "660146-556x370.jpg",
                        "ingredients": [
                            "Bell pepper",
                            "Pepper",
                            "Parsley",
                            "Garlic",
                            "Garlic powder",
                            "Capers plus 2 tablespoons caper juice",
                            "Lemon",
                            "Onion",
                            "Oregano",
                            "Pepper flakes",
                            "Salt",
                            "Sugar",
                            "Vinegar",
                            "Zucchini"
                        ],
                        "instructions": "Combine all of the ingredients the salad ingredients in a bowl.Combine all of the dressing ingredients in a cup and stir, adjust the ingredients to taste. Pour this over the salad and toss. Let the salad sit in the refrigerator for a few hours before serving.",
                        "isLiked": false
                    },
                    {
                        "id": "ca426cb7-0770-4fd3-90c8-a77adfdd6fb6",
                        "title": "Smokey Rainbow Chili",
                        "image": "660395-556x370.jpg",
                        "ingredients": [
                            "Olive oil",
                            "Zucchini",
                            "Bell pepper",
                            "Orange bell pepper",
                            "Jalapeno pepper",
                            "Garlic",
                            "Onion",
                            "Stewed tomatoes",
                            "Tomato paste",
                            "Black beans",
                            "Kernel corn",
                            "Kidney beans",
                            "Paprika",
                            "Chili powder",
                            "Oregano",
                            "Ground pepper",
                            "Cayenne pepper"
                        ],
                        "instructions": "(if using meat...brown the meat really well, remove and set aside. Add the meat after sauteing the veggies) Heat oil in a large pot over medium-high heat. Stir in zucchini, red bell pepper, orange bell pepper, jalapeno, garlic, and onion. Cook 5 minutes, just until tender. Add tomatoes with liquid, tomato paste, black beans, corn, and kidney beans into the pot. Season with smoked paprika, chili powder, oregano, black pepper, and cayenne pepper. Bring to a boil. Reduce heat to low and simmer 1 hour, stirring occasionally. (depending on how big you cut the veggies, you may want to let it simmer a little longer)",
                        "isLiked": false
                    },
                    {
                        "id": "860ff539-ca75-4d5b-a243-052c7cb2d60e",
                        "title": "Dry Mee Siam",
                        "image": "641687-556x370.jpg",
                        "ingredients": [
                            "Spice paste",
                            "Bean sprouts",
                            "Chilli",
                            "Chive",
                            "Egg",
                            "Fish sauce",
                            "Garlic",
                            "Limes and chillies when serve",
                            "Oil",
                            "Rice vermicelli",
                            "Shallot",
                            "Shrimp",
                            "Sugar",
                            "Tau kwa",
                            "Taucheo",
                            "Taucheo"
                        ],
                        "instructions": "Soak the vermicelli in water till soft for about 30 minutes (I used chilli brand), Drain and set aside.Using a food processor, grind the spice paste till fine and set aside.Heat wok with some oil and make the beaten eggs into an omelette. Fold and slice the omelette thinly. Set aside.Heat up the wok and add 3 tablespoons of oil. Once the oil is heated, fry the spice paste until aromatic and the oil separates. This ensures that the chillies are cooked through and you will not get that 'grassy' taste of raw chillies. Add shrimps, stir-frying until half done, then add the fried tofu pieces.Add the vermicelli and keep stirring until the spice paste has spread evenly. (you may add about half cup of water to it if you find the rice vermicelli is still quite dry when frying) Add sugar and salt to taste, if requred, followed by bean sprouts and chives. Continue to stir-fry until the vegetables are cooked. Taste and adjust the seasoning by adding more salt or sugar to taste. If the noodles taste bland, add a little soy sauce/fish sauce to taste.Garnish with shredded omelette, green lime and some red chillies on mee siam when serve.",
                        "isLiked": false
                    },
                    {
                        "id": "c32aa1e4-5392-4006-990e-f88f8cf36275",
                        "title": "Baked Rigatoni",
                        "image": "633766-556x370.jpg",
                        "ingredients": [
                            "Broccoli flowerets",
                            "Basil",
                            "Fennel seeds",
                            "Pasta sauce",
                            "Rigatoni",
                            "Mozzarella cheese",
                            "Ready-cut tomatoes",
                            "Vegetable burger crumbles"
                        ],
                        "instructions": "1. Preheat oven to 400 degrees. Cook pasta according to package directions, drain.2. Combine pasta, pasta sauce, tomatoes, broccoli, burger crumbles, basil, fennel seeds and 4 oz. of the mozzarella in a 9x13 baking dish. Top with remaining 2 oz. mozzarella. Bake until heated through, about 20 minutes.",
                        "isLiked": false
                    },
                    {
                        "id": "c58c3b2e-016e-43aa-bcee-26a0f8f9b642",
                        "title": "Easy Cheesy Scrambled Eggs",
                        "image": "641890-556x370.jpg",
                        "ingredients": [
                            "Egg",
                            "Milk",
                            "Salt and pepper",
                            "Jack cheese"
                        ],
                        "instructions": "Scramble eggs with milk or cream and some salt and pepper. Cook in a nonstick skillet over medium heat, stirring to lift the cooked eggs from the bottom of the pan as they cook. When the eggs are just about cooked, toss in jack cheese and cook for about 1-2 minutes more just to melt the cheese. Serve as is, over toast, or in a tortilla.",
                        "isLiked": false
                    },
                    {
                        "id": "d5480327-f6e3-434e-b368-b1d9d8242bf4",
                        "title": "Classic Hush Puppies",
                        "image": "639608-556x370.jpg",
                        "ingredients": [
                            "Baking powder",
                            "Baking soda",
                            "Canola oil",
                            "Dehydrated onion",
                            "Lemon juice",
                            "Milk",
                            "Parsley",
                            "Pepper sauce",
                            "Salt",
                            "Sugar",
                            "Flour",
                            "Cornmeal"
                        ],
                        "instructions": "In a cast iron skillet or a large heavy fry pan over medium-high heat, heat about 3 inches of oil to 350-360 F or until a small amount of batter dropped into the hot oil sizzles and floatsIn a large mixing bowl, combine all of the dry ingredients, parsley and onions.Add the lemon juice to the milk and set aside for 5 minutes (if using buttermilk omit the lemon juice). Add the egg and add to the milk, whisk to combine.Add 1 cup of the milk/egg mixture to the dry ingredients and combine to make a stiff batter (if the batter is too dry, add the rest of the milk; if the batter is too thin, add cornmeal). The batter should be thoroughly moistened, but should still hold a rounded shape on a spoon.Using a teaspoon, scoop up a heaping spoonful of batter and using another spoon (or fingertip) form into a rough ball and slide into the hot oil. Rinsing the spoon in cold water after every 3 balls makes forming them easier. Fry for approximately 5 minutes or until golden brown, turning to brown all sides.Remove from oil and place hushpuppies on paper towels; continue cooking the remaining batter. Keep warm in the oven until all the hushpuppies have been fried and dinner is ready to serve. Serve hot.",
                        "isLiked": false
                    },
                    {
                        "id": "70b4c9f8-2c21-4d86-a46a-e20b764d1cd5",
                        "title": "Lebanese Kibbeh",
                        "image": "649403-556x370.jpg",
                        "ingredients": [
                            "Bulgur wheat",
                            "Lamb",
                            "Onion",
                            "Butter",
                            "Salt & ground pepper",
                            "Sprg mint",
                            "Oil",
                            "Onion",
                            "Lamb",
                            "Pine nuts",
                            "Ground allspice",
                            "Greek yogurt",
                            "Garlic",
                            "Mint"
                        ],
                        "instructions": "1) Preheat the oven to 375F degrees. Rinse the bulgur wheat in a sieve and squeeze out the excess moisture. 2. Mix the lamb, onion and seasoning, kneading the mixture to make a thick paste. Add the bulgur wheat and blend together. 3. To make the filling, heat the oil in a frying pan and fry the onion until golden. Add the lamb or veal and cook, stirring, until evenly browned and then add the pine nuts, allspice and salt and pepper. 4. Oil a large baking dish and spread half of the meat and bulgur wheat mixture over the bottom. Spoon over the filling and top with a second layer of meat and bulgur wheat, pressing down firmly with the back of a spoon. 5. Pour the melted butter over the top and then bake on the oven for 40-45 minutes until browned on top. 6. Meanwhile make the yogurt dip: Blend together the yogurt and garlic, spoon into a serving bowl and sprinkle with the chopped mint. 7. Cut the cooked kibbeh into squares or rectangles and serve garnished with mint and accompanied by rice and the yogurt dip. NOTES The national dish of Syria and the Lebanon in Kibbeh, as kind of meatball made from minced lamp and bulgur wheat. Raw kibbeh is the most widely eaten type, but this version is very popular too.",
                        "isLiked": false
                    },
                    {
                        "id": "4d8a38bd-9448-4a65-80dc-2bd5839e4a99",
                        "title": "Rigatoni With Sweet Sausages In Creamy Tomato Sauce",
                        "image": "658357-556x370.jpg",
                        "ingredients": [
                            "Sausage",
                            "Leek",
                            "Sage",
                            "Garlic cloves",
                            "Onion",
                            "Canned tomatoes",
                            "Rigatoni",
                            "Milk",
                            "Thyme",
                            "Cayenne pepper",
                            "Butter",
                            "Extra virgin olive oil",
                            "Sugar",
                            "Salt& pepper"
                        ],
                        "instructions": "Bring a large pot of salted water to boil. Chop the onions, garlic, and set aside. Chop the leek (cut in 1/2 lengthwise first & make sure to rinse very well!!) and set aside (separate from the onions & garlic). Chop the sage & set aside separately as well. To easily remove the casings, lightly slice each sausage lengthwise. Peel off with your fingers. In a large pan over medium/high heat, cook the sausages until they are a nice golden brown. While cooking, break apart the mixture until it looks like ground meat. Take the meat out of the pan and save it in a bowl. Add 2 tbsp olive oil and add the sage to the pan. Cook for a minute, add the leeks & cayenne pepper. Cook for 2 to 3 minutes and put the meat back in the pan. When the leek is cooked, turn off the heat and keep in the mixture in the pan. For the tomato sauce: In a medium size pot over medium/ high heat, add 1 tbsp olive oil, thyme, garlic & onions. Cook for 3-4 minutes, until onions are translucent. Add crushed tomatoes, lower the heat and simmer for about 20 minutes (with a lose lid, otherwise the sauce will splatter all over your kitchen walls!) Add sugar and about 1 tsp kosher salt (1/2 tsp for regular salt), stir and cook for another 2 minutes. Puree the tomatoes until smooth. Add milk and butter, and stir. Keep the heat on very low or turn off until you are ready to serve. When rigatoni is cooked, add to the hot pan with the sausage mixture. Stir well, add a little olive oil if it looks dry. Plate and add tomato sauce to the pasta. Serve this way or with parmesan.",
                        "isLiked": false
                    },
                    {
                        "id": "7a2f6648-5f0b-46e5-8637-e8f98c6a811c",
                        "title": "Pecan-Baked Ham",
                        "image": "655540-556x370.jpg",
                        "ingredients": [
                            "Five-spice powder",
                            "Brown sugar",
                            "Butter",
                            "Ham",
                            "Onion",
                            "Pecan"
                        ],
                        "instructions": "Preheat the oven to 350. In a small bowl, mix the pecans, sugar, and five-spice powder with the butter until you have a fine, crumbly mixture. Rub generously over the ham, patting the crust with your hands.Scatter the onions in the bottom of a heavy roasting pan and add about 2 cups water. Place the ham on the bed of onions. Slide the pan into the oven and roast for about 2 hours, checking to make sure theres still liquid in the pan. As the water evaporates, add a bit more. The ham is done when a nice glaze forms on the outside.The pecan mixture and the water in the pan will create their own sauce to pour over the ham after youve sliced it into beautiful pink rounds. If the sauce seems too thin, just pour into a saucepan and reduce it.",
                        "isLiked": false
                    },
                    {
                        "id": "dad295ca-0374-4ea1-8a97-c44109be12c6",
                        "title": "Cannoli Ice Cream w. Pistachios & Dark Chocolate",
                        "image": "716410-556x370.jpg",
                        "ingredients": [
                            "Chocolate",
                            "Milk",
                            "Pistachio",
                            "Ricotta",
                            "Salt",
                            "Sugar",
                            "Vanilla"
                        ],
                        "instructions": "",
                        "isLiked": false
                    },
                    {
                        "id": "cd6ab920-7994-42df-8901-bd5dbc4acd42",
                        "title": "Swiss Chard Wraps",
                        "image": "662670-556x370.jpg",
                        "ingredients": [
                            "Swiss chard leaves",
                            "Orange cauliflower",
                            "Olive oil",
                            "Garlic",
                            "Salt",
                            "Basil",
                            "Zucchini",
                            "Bell pepper",
                            "Avocado",
                            "Trader joe's spicy peanut vinaigrette"
                        ],
                        "instructions": "Chop off the stems of the swiss chard at the point where it meets the leaf. You could stem the swiss chard entirely. I like leaving a bit of stem with the leaves to give better structure to the wraps. Chop the cauliflower into small pieces and pulse them in a food processor until it looks like rice. I usually pulse the cauliflower florets and the stalk together. Place the olive oil in a saut pan over medium-high heat. Once the pan is hot, add the garlic and let it fry for about a minute or two, or until the garlic starts to brown. Add the pulsed cauliflower rice and cook it for about 2-3 minutes. The cauliflower should turn into a vibrant yellow-orange color when it is cooked. Add a pinch of salt and chopped basil to the cauliflower and stir. Spiralize the zucchini with Blade B to create zucchini noodles. If you do not have a spiralizer, just create zucchini ribbons with a vegetable peeler. To assemble the wraps, place a large leaf flat down. Add a bit of sauted cauliflower, zucchini noodles, red pepper, and avocado along the swiss chard stalk. Drizzle a bit of vinaigrette on top of the vegetables and wrap everything up. Enjoy these wraps as a side to your favorite protein! Feel free to dip these wraps in more sauce. These wraps are best consumed when they are freshly made. Refrigerate any leftovers in an airtight container.",
                        "isLiked": false
                    },
                    {
                        "id": "ad344921-397e-4c9b-ba6e-f3dc001b9f56",
                        "title": "Baked Caramel Custard",
                        "image": "633492-556x370.jpeg",
                        "ingredients": [
                            "Egg substitute",
                            "Egg yolk",
                            "Evaporated skim milk",
                            "Port wine",
                            "Skim milk",
                            "Sugar plus",
                            "Sugar",
                            "Vanilla"
                        ],
                        "instructions": "Preheat the oven to 350 degrees. Scald the milks together in a heavy saucepan. Remove from the heat.Caramelize the sugar in a skillet over medium heat until it melts and turns brown. Slowly add the milks to the sugar, stirring constantly until the sugar dissolves.In a medium bowl, beat the egg substitute and egg yolk together until it is lemon-colored. Add the milk mixture, port, and vanilla and stir well.Pour the mixture into 6 custard cups and place them into a baking dish. Pour boiling water into the baking dish so that the water comes halfway up the sides of the cups. Place in the oven and bake until set, about 35 to 40 minutes.Remove the custard cups from the oven and cool completely in the refrigerator. When they are chilled, place a dessert plate on top of each custard cup and invert. Serve immediately.This recipe yields 6 servings.Serving size: 1/2 cup.",
                        "isLiked": false
                    },
                    {
                        "id": "bd89ccb8-2b53-445a-a80f-c3aac86c168f",
                        "title": "Korean Extra Crispy Fried Chicken w Sweet Spicy Glaze",
                        "image": "649049-556x370.jpg",
                        "ingredients": [
                            "Chicken wings",
                            "Canola oil",
                            "Garlic",
                            "Soy sauce",
                            "Thai chili peppers",
                            "Ketchup",
                            "Rice vinegar",
                            "Brown sugar",
                            "Sesame oil",
                            "Honey",
                            "Cornstarch",
                            "Water",
                            "Salt and pepper",
                            "Sesame seeds"
                        ],
                        "instructions": "1. Cut and discard the end tip of each chicken wing. cut remaining pieces in half at the joint to create 2 pieces. Rinse pieces under cold water and set to dry for at least 10 minutes. In a heavy pot such as a dutch oven, pour in canola or peanut oil to a depth of 3 inches. Heat over medium-high for about 15 minutes or until ready for frying. 2. In the meantime, combine sauce ingredients of soy, vinegar, sugar, honey, ketchup, sesame oil, Thai chili peppers, and the seasoning in a small sauce pan. Boil until sauce slightly thickens and then set at low heat. Adjust the spiciness/sweetness of the sauce by adding more minced red peppers and/or sugar, continuously tasting for desired result. 3. In a large mixing bowl, mix 1 cup cornstarch and salt and pepper. Individually coat each chicken wing pieces with the cornstarch and set aside. 4. In another bowl, whisk the remaining cornstarch and water together to make a runny, liquidy batter. Add each chicken wing one at a time and coat well. Shake off excess batter and fry the chicken in batches for about 10~13 minutes, or until golden brown, then drain on paper towels. Do not overcrowd the pan when frying each batch. 5. Flavor the wings with a brush or by tossing them all together in a mixing bowl. Transfer to a serving plate and garnish with sesame seeds. Enjoy and eat while hot!",
                        "isLiked": false
                    },
                    {
                        "id": "192862c1-bce5-4f7d-9219-d78bf63cb5d5",
                        "title": "Citrus Arugula Salad with Seared Scallops",
                        "image": "639512-556x370.png",
                        "ingredients": [
                            "Arugula",
                            "Cara cars orange",
                            "Radish",
                            "Persian cucumber",
                            "Green onion",
                            "Salt",
                            "Scallop"
                        ],
                        "instructions": "First, you'll want to thinly slice the radishes and cucumber; and, dice the green onion. In a bowl, squeeze half of the Cara Cara orange and pulp, add salt and whisk together. Add in the radish and cucumber slices, arugula and toss together. For the scallops: heat oil in a high heat. Place the scallops flat-side down in the hot pan. Don't overcrowd the pan, or the pan won't stay hot enough to give the scallops a good sear. If you have a lot of scallops, it's better to work in batches. Once you've placed the scallops in the pan, don't touch them. (Let them do their thing!) If you give in to the temptation to move the scallops around the pan, all you'll be doing is preventing them from forming the nice brown crust that you want. Because of variations in scallop thickness, pan temperatures and so on, it's not easy to pinpoint an exact cooking time. But after a couple of minutes, it's OK to peek underneath. If you see a nice, caramel-colored crust on the underside, they're ready to flip. Plate your salad and place 4 scallops on top. Scallops start to turn rubbery if you wait too long to serve them, so get them on the plate right away. And be sure to serve them with the beautiful caramel-colored crust facing up.",
                        "isLiked": false
                    },
                    
                    
]
